{
  "characters": [
    {
      "name": "narrator",
      "display_name": {
        "thai": "ผู้เล่าเรื่อง",
        "english": "Narrator"
      }
    },
    {
      "name": "player",
      "display_name": {
        "thai": "คุณ",
        "english": "You"
      }
    },
    {
      "name": "miki",
      "display_name": {
        "thai": "มิกิ",
        "english": "Miki"
      }
    },
    {
      "name": "takashi",
      "display_name": {
        "thai": "ทาคาชิ",
        "english": "Takashi"
      }
    },
    {
      "name": "yui",
      "display_name": {
        "thai": "ยูอิ",
        "english": "Yui"
      }
    }
  ],
  "entries": [
    {
      "character": "narrator",
      "text": {
        "thai": "เสียงกริ่งดังขึ้น บ่งบอกว่าถึงเวลาพักกลางวันแล้ว",
        "english": "The bell rings, signaling the start of lunch break."
      }
    },
    {
      "character": "miki",
      "text": {
        "thai": "ในที่สุดก็ถึงเวลาพักแล้ว! คุณอยากไปที่ไหนก่อนดี?",
        "english": "Finally, lunch break! Where would you like to go first?"
      },
      "choices": [
        {
          "text": {
            "thai": "ไปโรงอาหารกัน ฉันหิวมากแล้ว",
            "english": "Let's go to the cafeteria, I'm hungry."
          },
          "target_stage": 2
        },
        {
          "text": {
            "thai": "อยากเห็นห้องสมุดของโรงเรียนมากกว่า",
            "english": "I'd rather see the library first."
          },
          "target_stage": 5
        },
        {
          "text": {
            "thai": "พาฉันไปรู้จักเพื่อนของเธอบ้างสิ",
            "english": "Introduce me to some of your friends."
          },
          "target_stage": 8
        }
      ]
    },
    {
      "character": "miki",
      "text": {
        "thai": "โรงอาหารเลยนะ! ฉันชอบอาหารที่นี่มาก โดยเฉพาะแกงกะหรี่ของเชฟยามาดะ!",
        "english": "Cafeteria it is! I love the food here, especially Chef Yamada's curry!"
      }
    },
    {
      "character": "narrator",
      "text": {
        "thai": "คุณและมิกิเดินไปที่โรงอาหาร ที่นั่นเต็มไปด้วยนักเรียนและมีกลิ่นอาหารหอมฟุ้ง",
        "english": "You and Miki head to the cafeteria, which is bustling with students and filled with delicious aromas."
      }
    },
    {
      "character": "miki",
      "text": {
        "thai": "เราควรลองแกงกะหรี่ด้วยกัน! มันอร่อยมากจริงๆ นะ",
        "english": "We should try the curry together! It's really amazing."
      },
      "auto_proceed": 11
    },
    {
      "character": "miki",
      "text": {
        "thai": "ห้องสมุดเหรอ? แน่นอน! มันเงียบสงบและเป็นที่ที่ดีมากสำหรับการอ่านหนังสือ",
        "english": "The library? Sure! It's quiet and a great place to read."
      }
    },
    {
      "character": "narrator",
      "text": {
        "thai": "คุณและมิกิเดินไปที่ห้องสมุด ที่นั่นเต็มไปด้วยชั้นหนังสือสูงและมีบรรยากาศที่สงบ",
        "english": "You and Miki walk to the library. It's filled with tall bookshelves and has a peaceful atmosphere."
      }
    },
    {
      "character": "miki",
      "text": {
        "thai": "ห้องสมุดของเรามีหนังสือหลายประเภทมาก ทั้งเรื่องเรียนและนวนิยาย คุณชอบอ่านหนังสือแนวไหนเหรอ?",
        "english": "Our library has many types of books, both for studies and fiction. What kind of books do you like to read?"
      },
      "auto_proceed": 11
    },
    {
      "character": "miki",
      "text": {
        "thai": "แน่นอน! เพื่อนของฉันกำลังรออยู่ที่สวนหลังโรงเรียน ไปเจอพวกเขากันเถอะ!",
        "english": "Sure! My friends are waiting at the garden behind the school. Let's meet them!"
      }
    },
    {
      "character": "narrator",
      "text": {
        "thai": "คุณและมิกิเดินไปที่สวน ที่นั่นมีนักเรียนสองคนกำลังคุยกันอยู่ใต้ต้นไม้ใหญ่",
        "english": "You and Miki walk to the garden. There are two students chatting under a large tree."
      }
    },
    {
      "character": "miki",
      "text": {
        "thai": "นี่คือทาคาชิและยูอิ พวกเขาเป็นเพื่อนที่ดีที่สุดของฉัน!",
        "english": "These are Takashi and Yui, my best friends!"
      }
    },
    {
      "character": "narrator",
      "text": {
        "thai": "ขณะที่พักกลางวันดำเนินไป คุณได้พูดคุยและทำความรู้จักกับโรงเรียนใหม่มากขึ้น",
        "english": "As lunch break continues, you chat and get to know more about your new school."
      }
    },
    {
      "character": "miki",
      "text": {
        "thai": "อ้อ! เกือบลืมบอก หลังเลิกเรียนวันนี้มีกิจกรรมชมรมด้วย คุณสนใจจะเข้าร่วมชมรมไหนไหม?",
        "english": "Oh! I almost forgot to tell you, there are club activities after school today. Are you interested in joining any club?"
      },
      "choices": [
        {
          "text": {
            "thai": "ชมรมกีฬา",
            "english": "Sports club"
          },
          "target_stage": 13
        },
        {
          "text": {
            "thai": "ชมรมศิลปะ",
            "english": "Art club"
          },
          "target_stage": 14
        },
        {
          "text": {
            "thai": "ชมรมวิทยาศาสตร์",
            "english": "Science club"
          },
          "target_stage": 15
        },
        {
          "text": {
            "thai": "ยังไม่แน่ใจ ขอคิดดูก่อน",
            "english": "Not sure yet, I'll think about it"
          },
          "target_stage": 16
        }
      ]
    },
    {
      "character": "miki",
      "text": {
        "thai": "ชมรมกีฬาเหรอ? เยี่ยมเลย! ทาคาชิก็อยู่ชมรมนี้เหมือนกัน พวกเขากำลังต้องการคนเพิ่มพอดี!",
        "english": "Sports club? Great! Takashi is in that club too. They're looking for new members!"
      },
      "auto_proceed": 17
    },
    {
      "character": "miki",
      "text": {
        "thai": "ชมรมศิลปะเหรอ? ฉันชอบเลย! ยูอิเป็นประธานชมรมนี้ด้วย เธอวาดรูปได้สวยมาก!",
        "english": "Art club? I love it! Yui is the president of that club. She draws beautifully!"
      },
      "auto_proceed": 17
    },
    {
      "character": "miki",
      "text": {
        "thai": "ชมรมวิทยาศาสตร์? น่าสนใจมาก! พวกเขามีการทดลองสนุกๆ ทุกสัปดาห์เลยนะ!",
        "english": "Science club? Very interesting! They have fun experiments every week!"
      },
      "auto_proceed": 17
    },
    {
      "character": "miki",
      "text": {
        "thai": "ไม่เป็นไร ไม่ต้องรีบตัดสินใจก็ได้ คุณมีเวลาลองดูชมรมต่างๆ ก่อนตัดสินใจได้เลย",
        "english": "No problem, no rush to decide. You have time to explore different clubs before making a decision."
      },
      "auto_proceed": 17
    },
    {
      "character": "narrator",
      "text": {
        "thai": "เสียงกริ่งดังขึ้นอีกครั้ง บ่งบอกว่าเวลาพักกลางวันหมดลงแล้ว",
        "english": "The bell rings again, signaling the end of lunch break."
      }
    },
    {
      "character": "miki",
      "text": {
        "thai": "แย่แล้ว! เราต้องรีบกลับไปที่ห้องเรียนแล้ว! ไปกันเถอะ!",
        "english": "Oh no! We need to hurry back to class! Let's go!"
      }
    },
    {
      "character": "narrator",
      "text": {
        "thai": "ขณะที่คุณวิ่งกลับไปที่ห้องเรียนพร้อมกับมิกิ คุณรู้สึกว่าการใช้ชีวิตที่โรงเรียนใหม่นี้จะน่าสนใจมากทีเดียว",
        "english": "As you run back to the classroom with Miki, you feel that life at this new school is going to be very interesting."
      },
      "actions": ["change_scene:intro"]
    }
  ]
}